Autodesk.Revit.UI.RevitFileInfo.Name
The name of the recent file.
If a cloud file, it looks like "Cloud Model://Shanghai Design Center/4walls.rvt"
If a local file, path, localPath and name are all the same.
Since:
2019